;Определяем режим работы интерфейса: режим 8 битового байта 
	    CLR SM0 
	    SETB SM1 
;Настройка удвоенной скорости. Устанавливаем SMOD в единицу. 
;SMOD - бит управления скоростью в регистре PCON (Power Control) 
	    MOV A, PCON 
	    SETB ACC.7 
	    MOV PCON, A 
;Разрешение приема
;Разрешить получать байты через UART
;Находится в SCON  
	    SETB REN 
;Настройка таймера
	    MOV TMOD, #20H	; Timer mode register - режим 2 (8 битный автоперегрузка (M1=1,M0=0)) 
	    MOV TH1, #243	; Регистр переполнения (автоматически копируется в TL1 при переполнении) 
	    MOV TL1, #243	; Счетчик 
	    SETB TR1		; Запуск счетчика (6 бит в TCON) 
	    MOV R1, #49H 
	    MOV R0, #0AH 

RECEIVE_BYTE: 
;Ожидание приема 
	    JNB RI, $		; Ждем, пока установится RI (байт получен).
	    CLR RI			; Необходимо очистить RI перед следующим приемом
	    MOV A, SBUF		; Считываем полученный байт из буфера UART

; Управление четностью 
; Если ACC.7 = 0 -> отсутствует бит паритета -> пропустить обработку 
; Если ACC.7 = 1 -> включен бит паритета: 
;     - Очистить ACC.7 чтобы восстановить исходные 7/8 биты данных 
;     - Используем флаг P для определения фактической паритета данных 
;     - Сохраняем флаги режима паритета в регистре B: 
;           B.4 = 1 -> Паритет включен 
;           B.0 = 0/1 -> четное/нечетное  
	    JNB ACC.7, STORE_BYTE	; Если бит 7 = 0 -> паритет не включен -> пропускаем проверки
	    CLR ACC.7				; Удалить бит паритета из полученного значения 
	    JNB P, PARITY_EVEN		; Если P=0 - четное число единиц - паритет четный

	    ; Нечетный паритет
	    MOV B, #10H				; B = 00010000b - паритет включен, нечетный режим 
	    SJMP STORE_BYTE 

PARITY_EVEN: 
	    MOV B, #11H				; B = 00010001b - паритет включен + правило инвертирования 

STORE_BYTE: 
;Сохранение данных 
	    MOV @R1, A 
	    INC R1 
;Проверка окончания чтения 
	    DEC R0 
	    MOV A, R0 
	    JNZ RECEIVE_BYTE					; Если ожидается больше байт - продолжить прием
	    CLR REN								; Запрет приема после завершения приема

        MOV R1, #49H               ; Сбросить указатель на начало    данных

;-------------------------------------------------------------
; Инициализация LCD (4-битный интерфейс)
; Порт P1: 
;   P1.3 = RS (Register Select: 0-инструкции, 1-данные)
;   P1.2 = E  (Enable, строб)
;   P1.7-P1.4 = DB7-DB4 (старшие 4 бита данных)
; Все команды отправляются двумя полубайтами (старший полубайт первым)
;-------------------------------------------------------------

        CLR P1.3                   ; RS=0 - режим инструкций


;===============================================================================
; ФУНКЦИЯ УСТАНОВКИ — ПЕРЕХОД В 4-БИТНЫЙ РЕЖИМ
; Требуется последовательность из 3-х отправок старшего полубайта
;===============================================================================

        ; Первый старший полубайт: 0010b - запрос 4-битного режима
        CLR P1.7                  ; DB7=0
        CLR P1.6                  ; DB6=0
        SETB P1.5                 ; DB5=1
        CLR P1.4                  ; DB4=0

        SETB P1.2                 ; E=1
        CLR  P1.2                 ; E=0
        CALL delay

        ; Второй идентичный старший полубайт: требуется по протоколу инициализации
        SETB P1.2                 ; E=1
        CLR  P1.2                 ; E=0

        ; Третий полубайт (младшая часть команды установки функции): N=1, F=0
        SETB P1.7           ; DB3=1 (N=1 - 2 строки)
                            ; DB2..DB0 оставлены =0 (F=0 - матрица 5x8)

        SETB P1.2                 ; E=1
        CLR  P1.2                 ; E=0
        CALL delay

;===============================================================================
; УСТАНОВКА РЕЖИМА ВВОДА — СДВИГ ДИСПЛЕЯ
; Команда: 0000 0110b
;===============================================================================
        ; Старший полубайт = 0000
        CLR P1.7
        CLR P1.6
        CLR P1.5
        CLR P1.4

        SETB P1.2                 ; E=1
        CLR  P1.2                 ; E=0

        ; Младший полубайт = 0101 (I/D=0 - влево, декремент, S=1 - сдвиг дисплея)
        CLR P1.7                  ; DB3 = 0 — выставляем старший бит младшего полубайта в 0 (соответствует биту команды)
        SETB P1.6                 ; DB2 = 1 — выставляем второй бит младшего полубайта в 1 
        CLR P1.5                  ; DB1 = 0 — выставляем третий бит младшего полубайта в 0 (I/D = 0 сдвиг курсора влево, сдвиг дисплея в противоположную сторону)
        CLR P1.4                 ; DB0 = 1 — выставляем младший бит младшего полубайта в 1 (S = 1 -> сдвиг дисплея включён)

        SETB P1.2                 ; E=1
        CLR  P1.2                 ; E=0
        CALL delay


;===============================================================================
; УПРАВЛЕНИЕ ДИСПЛЕЕМ — ДИСПЛЕЙ ВКЛ, КУРСОР ВКЛ, МИГАНИЕ ВКЛ
; Команда: 0000 1111b
;===============================================================================

        ; Старший полубайт = 0000
        CLR P1.7
        CLR P1.6
        CLR P1.5
        CLR P1.4

        SETB P1.2
        CLR  P1.2

        ; Младший полубайт = 1111 (D=1, C=1, B=1)
        SETB P1.7           ; DB3=1
        SETB P1.6           ; DB2=1 - дисплей включен
        SETB P1.5           ; DB1=1 - курсор включен
        SETB P1.4           ; DB0=1 - мигание включено

        SETB P1.2
        CLR  P1.2
        CALL delay

;===============================================================================
; ОТПРАВКА ПРИНЯТЫХ ДАННЫХ НА LCD (RS=1 - режим данных)
;===============================================================================

        SETB P1.3           ; RS=1 - режим данных (отправка символов)
        MOV R1, #49H        ; Указатель на начало буфера ASCII
        MOV R2, #00H        ; Счетчик символов в текущей строке
        MOV R3, #20H        ; Счетчик оставшихся символов (32 символа максимум)
        CALL setLine1End    ; установить курсор в правый конец 1-й строки

;-------------------------------------------------------------
; Основной цикл вывода на дисплей
;-------------------------------------------------------------
DISPLAY_LOOP:
        MOV A, @R1          ; Загрузить байт из буфера
        JZ FINISH           ; Если 0x00 - конец строки - завершить

        MOV A, R3           ; Проверить, остались ли символы для вывода
        JZ FINISH           ; Если R3=0 - завершить

		; Проверка перехода на вторую строку
        CJNE R2, #16, SEND_CHAR ; Если выведено меньше 16 символов, продолжить
        CALL setLine2End    ; перейти в правый конец 2-й строки
        MOV R2, #00H            ; Сбросить счетчик символов в строке

; Отправка символа на дисплей
SEND_CHAR:
        MOV A, @R1          ; Загрузить символ для отправки
        CALL sendCharacter  ; Отправить ASCII символ на LCD
        INC R1              ; Следующий символ
        INC R2              ; Увеличить счетчик символов в текущей строке
        DEC R3              ; Уменьшить счетчик оставшихся символов
        JMP DISPLAY_LOOP    ; Продолжить вывод

FINISH:
        JMP     $                


;===============================================================================
; sendCharacter — ОТПРАВКА ОДНОГО ASCII СИМВОЛА В 4-БИТНОМ РЕЖИМЕ
; Отправляет старший полубайт, затем младший
;===============================================================================
sendCharacter:
        ; Старший полубайт (ACC.7..ACC.4)
        MOV C, ACC.7        ; Перенести 7-й бит аккумулятора в перенос
        MOV P1.7, C         ; Установить DB7
        MOV C, ACC.6        ; Перенести 6-й бит
        MOV P1.6, C         ; Установить DB6
        MOV C, ACC.5        ; Перенести 5-й бит
        MOV P1.5, C         ; Установить DB5
        MOV C, ACC.4        ; Перенести 4-й бит
        MOV P1.4, C         ; Установить DB4

        SETB P1.2           
        CLR P1.2            

        ; Младший полубайт (ACC.3..ACC.0)
        MOV C, ACC.3        ; Перенести 3-й бит
        MOV P1.7, C         ; Установить DB7
        MOV C, ACC.2        ; Перенести 2-й бит
        MOV P1.6, C         ; Установить DB6
        MOV C, ACC.1        ; Перенести 1-й бит
        MOV P1.5, C         ; Установить DB5
        MOV C, ACC.0        ; Перенести 0-й бит
        MOV P1.4, C         ; Установить DB4

        SETB P1.2          
        CLR P1.2           

        CALL delay         
        RET                


;===============================================================================
; delay — КОРОТКАЯ ПРОГРАММНАЯ ЗАДЕРЖКА
;===============================================================================
delay:
        MOV R0, #50         ; Загрузить счетчик задержки
        DJNZ R0, $          ; Уменьшать R0 до 0 (внутренний цикл)
        RET                 ; Возврат из подпрограммы

;===============================================================================
; setLine1End — установить DDRAM адрес на правый конец 1-й строки (0x0F -> cmd 0x8F)
;===============================================================================
setLine1End:
        CLR P1.3
        ; старший полубайт 1000
        SETB P1.7
        CLR P1.6
        CLR P1.5
        CLR P1.4
        SETB P1.2
        CLR P1.2

        ; младший полубайт 1111 (0xF)
        SETB P1.7
        SETB P1.6
        SETB P1.5
        SETB P1.4
        SETB P1.2
        CLR P1.2

        CALL delay
        SETB P1.3
        RET

;===============================================================================
; setLine2End — правый конец 2-й строки
;===============================================================================
setLine2End:
        CLR P1.3
        ; старший полубайт = 1100
        SETB P1.7
        SETB P1.6
        CLR P1.5
        CLR P1.4
        SETB P1.2
        CLR P1.2

        ; младший полубайт = 1111
        SETB P1.7
        SETB P1.6
        SETB P1.5
        SETB P1.4
        SETB P1.2
        CLR P1.2

        CALL delay
        SETB P1.3
        RET             

        END